Revit 2027 API
FamilyInstance.Split Method
Splits the family instance element at a point on its defining curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId Split(
	double param
)
Public Function Split (
	param As Double
) As ElementId
public:
ElementId^ Split(
	double param
)
member Split :
        param : float -> ElementId
Parameters
param Double
The normalized parameter value along the element (should be greater than 0 and less than 1).
Return Value
ElementId
The newly created family instance id.
Exceptions
Exception | Condition
ArgumentException | Thrown when parameter is out of range.
InvalidOperationException | Thrown when the family instance element cannot be split.
Remarks
Splitting is permitted for architectural and structural columns, beams and braces. Beams and braces that are not a line or an arc is not permitted. See CanSplit to determine if the family instance is allowed to be split by this method.
Splitting modifies this family instance and adds a second family instance to the model.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace